/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: thine <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/01/14 16:58:06 by thine             #+#    #+#             */
/*   Updated: 2025/01/14 17:25:38 by thine            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	main(int argc, char *argv[])
{
	//if argc==1
	//if argc==2 操作なし
	//if argc==3 必要に応じてsa
	//if argc==4 3つのソート
	//if argc>=5 頑張る
}

int	push_swap(int argc, char *argv[])
{	
	//線形リストに格納する
}
